xlg_price = 780000  # 修炼果的价格(梦幻币)
mhb_price = 125000  # 1RMB可兑换梦幻币数量
rw_gf_xl_factor = 3000          # 人物功法修炼 1修炼点 = 3000 梦幻币
rw_kx_xl_factor = 2000          # 人物抗性修炼 1修炼点 = 2000 梦幻币
bb_xl_factor = xlg_price / 150  # 宠修 1修炼点 = (修炼果价格 / 150) 梦幻币 = 5200 梦幻币

bb_xlsx_price = [4136900, 5095200, 7696300, 12761600, 21112502]  # 宠修上限21-25的梦幻币花费
rw_xlsx_xld = [3150, 3510, 3890, 4290, 4710]                     # 人修上限21-25的修炼点花费

# 0-25级修炼所需花费修炼点数
xld = [
    150, 210, 290, 390, 510,
    650, 810, 990, 1190, 1410,
    1650, 1910, 2190, 2490, 2810,
    3150, 3510, 3890, 4290, 4710,
    5150, 5610, 6090, 6590, 7110
]

# 100-180级师门技能花费梦幻币
sm = [
    270544
]

